<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>开源服务发现（翻译） - Andy&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="服务发现是大多数分布式系统和面向服务的架构的重要组成部分，这个问题看上去很简单，是在多台主机组成的集群中，客户程序如何发现提供某个服务的主机的IP地址和端口号么？
通常情况下，你或许最开始只是用配置文件来解决这个问题，但是，当你部署更多的服务时，解决这个问题就变得非常复杂。在运行的系统中，由于人为的或自动的集群扩展、新的服务被部署以及主机宕机或被替换，服务的位置（IP和端口号）变化会非常频繁。">
<meta property="og:type" content="article">
<meta property="og:title" content="开源服务发现（翻译）">
<meta property="og:url" content="http://blog.duhongguang.com/2016/01/22/translations/Open-Source-Service-Discovery/index.html">
<meta property="og:site_name" content="Andy's Blog">
<meta property="og:description" content="服务发现是大多数分布式系统和面向服务的架构的重要组成部分，这个问题看上去很简单，是在多台主机组成的集群中，客户程序如何发现提供某个服务的主机的IP地址和端口号么？
通常情况下，你或许最开始只是用配置文件来解决这个问题，但是，当你部署更多的服务时，解决这个问题就变得非常复杂。在运行的系统中，由于人为的或自动的集群扩展、新的服务被部署以及主机宕机或被替换，服务的位置（IP和端口号）变化会非常频繁。">
<meta property="og:updated_time" content="2016-02-29T10:01:17.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="开源服务发现（翻译）">
<meta name="twitter:description" content="服务发现是大多数分布式系统和面向服务的架构的重要组成部分，这个问题看上去很简单，是在多台主机组成的集群中，客户程序如何发现提供某个服务的主机的IP地址和端口号么？
通常情况下，你或许最开始只是用配置文件来解决这个问题，但是，当你部署更多的服务时，解决这个问题就变得非常复杂。在运行的系统中，由于人为的或自动的集群扩展、新的服务被部署以及主机宕机或被替换，服务的位置（IP和端口号）变化会非常频繁。">
  
  
    <link rel="icon" href="/favicon.png">
  
  <link href="/webfonts/ptserif/main.css" rel='stylesheet' type='text/css'>
  <link href="/webfonts/source-code-pro/main.css" rel="stylesheet" type="text/css">
  <link rel="stylesheet" href="/css/style.css" type="text/css">
  
<!-- Google Analytics -->
<script type="text/javascript">
(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', '[object Object]', 'auto');
ga('send', 'pageview');

</script>
<!-- End Google Analytics -->


</head>

<body>
  <div id="container">
    <header id="header">
  <div id="header-outer" class="outer">
    <div id="header-inner" class="inner">
      <a id="main-nav-toggle" class="nav-icon" href="javascript:;"></a>
      <a id="logo" class="logo" href="/"></a>
      <nav id="main-nav">
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
          <a class="main-nav-link" href="/categories">Categories</a>
        
          <a class="main-nav-link" href="/tags">Tags</a>
        
          <a class="main-nav-link" href="/about.html">About</a>
        
      </nav>
      <nav id="sub-nav">
        <div id="search-form-wrap">
          <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://blog.duhongguang.com"></form>
        </div>
      </nav>
    </div>
  </div>
</header>
    <section id="main" class="outer"><article id="post-translations/Open-Source-Service-Discovery" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      开源服务发现（翻译）
    </h1>
  

      </header>
    
    <div class="article-meta">
      <a href="/2016/01/22/translations/Open-Source-Service-Discovery/" class="article-date">
  <time datetime="2016-01-22T09:44:02.000Z" itemprop="datePublished">2016-01-22</time>
</a>
      
  <div class="article-category">
    <a class="article-category-link" href="/categories/translations/">translations</a>
  </div>

      
        <div class="article-comment-link-wrap">
          <a href="http://blog.duhongguang.com/2016/01/22/translations/Open-Source-Service-Discovery/#disqus_thread" class="article-comment-link">评论</a>
        </div>
      
    </div>
    <div class="article-entry" itemprop="articleBody">
      
        <link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/KaTeX/0.5.1/katex.min.css"><p>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x662F;&#x5927;&#x591A;&#x6570;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x548C;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x662F;&#x5728;&#x591A;&#x53F0;&#x4E3B;&#x673A;&#x7EC4;&#x6210;&#x7684;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x53D1;&#x73B0;&#x63D0;&#x4F9B;&#x67D0;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x4E3B;&#x673A;&#x7684;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x4E48;&#xFF1F;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x6216;&#x8BB8;&#x6700;&#x5F00;&#x59CB;&#x53EA;&#x662F;&#x7528;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x90E8;&#x7F72;&#x66F4;&#x591A;&#x7684;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x590D;&#x6742;&#x3002;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x4EBA;&#x4E3A;&#x7684;&#x6216;&#x81EA;&#x52A8;&#x7684;&#x96C6;&#x7FA4;&#x6269;&#x5C55;&#x3001;&#x65B0;&#x7684;&#x670D;&#x52A1;&#x88AB;&#x90E8;&#x7F72;&#x4EE5;&#x53CA;&#x4E3B;&#x673A;&#x5B95;&#x673A;&#x6216;&#x88AB;&#x66FF;&#x6362;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;IP&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#xFF09;&#x53D8;&#x5316;&#x4F1A;&#x975E;&#x5E38;&#x9891;&#x7E41;&#x3002;</p>
<a id="more"></a>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x4E2D;&#x65AD;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x52A8;&#x6001;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x3002;&#x672C;&#x7BC7;&#x535A;&#x5BA2;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x5F00;&#x6E90;&#x7684;&#x548C;&#x516C;&#x8BA4;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4EE5;&#x6B64;&#x6765;&#x63A2;&#x7A76;&#x52A8;&#x6001;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x5177;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5B58;&#x50A8;&#x7684;&#x5F3A;&#x6216;&#x5F31;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x8FD0;&#x884C;&#x65F6;&#x4F9D;&#x8D56;&#x3001;&#x5BA2;&#x6237;&#x7AEF;&#x96C6;&#x6210;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5728;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E0A;&#x9762;&#x662F;&#x5982;&#x4F55;&#x505A;&#x51FA;&#x6743;&#x8861;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4ECE;&#x4E00;&#x4E9B;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5F00;&#x59CB;&#xFF0C;&#x6BD4;&#x5982; <a href="http://zookeeper.apache.org/" target="_blank" rel="external">Zookeeper</a>, <a href="https://github.com/ha/doozer" target="_blank" rel="external">Doozer</a> &#x548C; <a href="https://github.com/coreos/etcd" target="_blank" rel="external">Etcd</a> &#xFF0C;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x4E00;&#x822C;&#x662F;&#x505A;&#x4E3A;&#x670D;&#x52A1;&#x534F;&#x8C03;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x901A;&#x5E38;&#x88AB;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x4E13;&#x95E8;&#x4E3A;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x6D4B;&#x8BD5;<a href="http://nerds.airbnb.com/smartstack-service-discovery-cloud/" target="_blank" rel="external">Airbnb&#x2019;s SmartStack</a>, <a href="https://github.com/Netflix/eureka" target="_blank" rel="external">Netflix&#x2019;s Eureka</a>, <a href="http://bitly.github.io/nsq/" target="_blank" rel="external">Bitly&#x2019;s NSQ</a>, <a href="http://serfdom.io/" target="_blank" rel="external">Serf</a>, <a href="http://labs.spotify.com/tag/dns/" target="_blank" rel="external">Spotify and DNS</a> &#x548C; <a href="https://github.com/skynetservices/skydns" target="_blank" rel="external">SkyDNS</a>&#x3002;</p>
<h1 id="&#x95EE;&#x9898;">&#x95EE;&#x9898;</h1><p>&#x5B9A;&#x4F4D;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x5373;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x670D;&#x52A1;&#x53D1;&#x73B0;</p>
<ul>
<li>&#x670D;&#x52A1;&#x6CE8;&#x518C;&#xFF1A;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x5C06;&#x670D;&#x52A1;&#x7684;&#x4F4D;&#x7F6E;&#x6CE8;&#x518C;&#x5230;&#x4E00;&#x4E2A;&#x4E2D;&#x592E;&#x6CE8;&#x518C;&#x5668;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x6CE8;&#x518C;&#x670D;&#x52A1;&#x7684;IP&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x5305;&#x62EC;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x51ED;&#x8BC1;&#x3001;&#x534F;&#x8BAE;&#x3001;&#x7248;&#x672C;&#x53F7;&#x3001;&#x73AF;&#x5883;&#x7B49;&#x7EC6;&#x8282;&#x3002;</li>
<li>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF1A;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x6307;&#x670D;&#x52A1;&#x6D88;&#x8D39;&#x8005;&#x5411;&#x4E2D;&#x592E;&#x6CE8;&#x518C;&#x5668;&#x67E5;&#x8BE2;&#x670D;&#x52A1;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
<p>&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E5F;&#x6709;&#x5F00;&#x53D1;&#x548C;&#x64CD;&#x4F5C;&#x65B9;&#x9762;&#x7684;&#x8003;&#x8651;&#xFF1A;</p>
<ul>
<li>&#x76D1;&#x63A7;&#xFF1A;&#x6BD4;&#x5982;&#x5F53;&#x6CE8;&#x518C;&#x7684;&#x670D;&#x52A1;&#x5931;&#x8D25;&#x4E86;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6709;&#x65F6;&#x4F1A;&#x7ACB;&#x5373;&#x79FB;&#x9664;&#x5931;&#x6548;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x5229;&#x7528;&#x5176;&#x5B83;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6848;&#x3002;&#x670D;&#x52A1;&#x4E00;&#x822C;&#x8981;&#x5B9E;&#x73B0;&#x5FC3;&#x8DF3;&#x68C0;&#x6D4B;&#x673A;&#x5236;&#x4EE5;&#x4FDD;&#x8BC1;&#x670D;&#x52A1;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x5BA2;&#x6237;&#x7AEF;&#x4E5F;&#x9700;&#x8981;&#x80FD;&#x591F;&#x53EF;&#x9760;&#x7684;&#x5904;&#x7406;&#x670D;&#x52A1;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x3002;</li>
<li>&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF1A;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x88AB;&#x6CE8;&#x518C;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5982;&#x4F55;&#x5E73;&#x8861;&#x670D;&#x52A1;&#x7684;&#x8D1F;&#x8377;?&#x5982;&#x679C;&#x5B58;&#x5728;Master&#x8282;&#x70B9;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x80FD;&#x4E0D;&#x80FD;&#x6B63;&#x786E;&#x7684;&#x53D1;&#x73B0;&#xFF08;&#xFF1F;&#xFF1F;&#xFF1F;&#xFF09;&#x3002;</li>
<li>&#x96C6;&#x6210;&#x65B9;&#x5F0F;&#xFF1A;&#x6CE8;&#x518C;&#x5668;&#x662F;&#x5426;&#x53EA;&#x662F;&#x652F;&#x6301;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4EC5;&#x4EC5;&#x652F;&#x6301;Java&#xFF1F;&#x96C6;&#x6210;&#x65F6;&#x662F;&#x5426;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x5D4C;&#x5165;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7684;&#x534F;&#x52A9;&#x7A0B;&#x5E8F;&#xFF1F;&#xFF08;&#x539F;&#x6587;&#x662F;&#xFF1A; is a <em>sidekick</em> process an option?&#xFF09;</li>
<li>&#x8FD0;&#x884C;&#x65F6;&#x4F9D;&#x8D56;&#xFF1A;&#x8FD0;&#x884C;&#x65F6;&#x662F;&#x5426;&#x9700;&#x8981;JVM&#x3001;Ruby&#x6216;&#x8005;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E0E;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3002;</li>
<li>&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF1A;&#x80FD;&#x5426;&#x5728;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5931;&#x6548;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF1F;&#x80FD;&#x591F;&#x65E0;&#x4E2D;&#x65AD;&#x66F4;&#x65B0;&#xFF1F;&#x6CE8;&#x518C;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x6210;&#x4E3A;&#x4F60;&#x6574;&#x4E2A;&#x67B6;&#x6784;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5355;&#x70B9;&#x5931;&#x6548;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</li>
</ul>
<h1 id="&#x901A;&#x7528;&#x578B;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x6846;&#x67B6;">&#x901A;&#x7528;&#x578B;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x6846;&#x67B6;</h1><p>&#xFF08;&#x5373;General Purpose Registries&#xFF0C;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;Single Purpose Registries&#x6765;&#x8BF4;&#x7684;&#xFF0C;&#x6307;&#x8FD9;&#x4E9B;&#x6CE8;&#x518C;&#x5668;&#x5E76;&#x4E0D;&#x662F;&#x4E13;&#x95E8;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x7684;&#xFF09;</p>
<p>Zookeeper, Doozer, Etcd&#x8FD9;&#x4E09;&#x4E2A;&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x4E86;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#xFF0C;&#x5E76;&#x4E14;&#x88AB;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x901A;&#x7528;&#x7684;&#x76EE;&#x7684;&#xFF1A;&#x4E00;&#x81F4;&#x6027;&#x5B58;&#x50A8;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5C06;&#x4ED6;&#x4EEC;&#x89C6;&#x4E3A;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x6846;&#x67B6;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x88AB;&#x7528;&#x6765;&#x4E3A;leader&#x9009;&#x4E3E;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x534F;&#x8C03;&#x6216;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x5BA2;&#x6237;&#x7AEF;&#x96C6;&#x5408;&#x63D0;&#x4F9B;&#x96C6;&#x4E2D;&#x9501;&#x3002;</p>
<h2 id="zookeeper">Zookeeper</h2><p><a href="http://zookeeper.apache.org/" target="_blank" rel="external">Zookeeper</a> &#x662F;&#x4E00;&#x4E2A;&#x96C6;&#x4E2D;&#x5F0F;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x4F9B;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x4FEE;&#x6539;&#x3001;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x3001;&#x63D0;&#x4F9B;&#x5206;&#x5E03;&#x5F0F;&#x540C;&#x6B65;&#x548C;&#x7EC4;&#x670D;&#x52A1;&#x3002;Zookeeper&#x7531;Java&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x5177;&#x5907;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F7F;&#x7528; <a href="http://www.stanford.edu/class/cs347/reading/zab.pdf" target="_blank" rel="external">Zab</a> &#x534F;&#x8BAE;&#x6765;&#x534F;&#x8C03;&#x96C6;&#x7FA4;&#x7684;&#x53D8;&#x66F4;&#x3002;</p>
<p>Zookeeper&#x901A;&#x5E38;&#x8FD0;&#x884C;&#x5728;&#x96C6;&#x7FA4;&#x7684;3&#x3001;5&#x3001;7&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6839;&#x636E;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7279;&#x5B9A;&#x7684; <a href="https://cwiki.apache.org/confluence/display/ZOOKEEPER/ZKClientBindings" target="_blank" rel="external">Client Binding</a> &#x6765;&#x8BBF;&#x95EE;Zookeeper&#x96C6;&#x7FA4;&#xFF0C;&#x8BBF;&#x95EE;&#x901A;&#x5E38;&#x88AB;&#x5D4C;&#x5165;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x670D;&#x52A1;&#x4E2D;&#x3002;</p>
<p>&#x5728;Zookeeper&#x4E2D;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x4E2D;&#x5B9E;&#x73B0;&#x4E34;&#x65F6;&#x8282;&#x70B9;&#xFF08; <a href="http://zookeeper.apache.org/doc/r3.2.1/zookeeperProgrammers.html#Ephemeral+Nodes" target="_blank" rel="external">ephemeral nodes</a> &#xFF09;&#xFF0C;&#x4E34;&#x65F6;&#x8282;&#x70B9;&#x53EA;&#x5B58;&#x5728;&#x4E8E;&#x670D;&#x52A1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5C06;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x6CE8;&#x518C;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x4E34;&#x65F6;&#x8282;&#x70B9;&#x5C31;&#x4F1A;&#x5C06;&#x4F1A;&#x88AB;&#x79FB;&#x9664;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x901A;&#x8FC7;&#x83B7;&#x53D6;&#x548C;&#x76D1;&#x63A7;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x4E0B;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x5F53;&#x524D;&#x6CE8;&#x518C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7528;&#x6216;&#x8005;&#x65B0;&#x7684;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x540E;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x6536;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x901A;&#x77E5;&#xFF0C;&#x5E94;&#x7528;&#x9700;&#x8981;&#x5904;&#x7406;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x670D;&#x52A1;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>Zookeeper&#x7684;API&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x96BE;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#xFF0C;&#x8BED;&#x8A00;&#x7ED1;&#x5B9A;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x7EC6;&#x5FAE;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x8D77;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;JVM&#x7684;&#x8BED;&#x8A00;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;<a href="http://curator.apache.org/curator-x-discovery/index.html" target="_blank" rel="external">Curator Service Discovery Extension</a>&#x3002;</p>
<p>&#x56E0;&#x4E3A;Zookeeper&#x662F;&#x4E00;&#x4E2A;<a href="https://en.wikipedia.org/wiki/CAP_theorem" target="_blank" rel="external">CP</a>&#xFF08;&#x4E00;&#x81F4;&#x6027;&#x3001;&#x5206;&#x533A;&#x5BB9;&#x9519;&#x6027;&#xFF09;&#x7CFB;&#x7EDF;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5C3D;&#x7BA1;&#x670D;&#x52A1;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4E5F;&#x65E0;&#x6CD5;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x670D;&#x52A1;&#x4E86;&#xFF0C;&#x7279;&#x522B;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x975E;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x8BFB;&#x6570;&#x636E;&#x548C;&#x5199;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;</p>
<h2 id="doozer">Doozer</h2><p><a href="https://github.com/ha/doozerd" target="_blank" rel="external">Doozer</a> &#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x6027;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x7531;Go&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x662F;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x670D;&#x52A1;&#x5E76;&#x4E14;&#x4F7F;&#x7528; <a href="http://research.microsoft.com/en-us/um/people/lamport/pubs/lamport-paxos.pdf" target="_blank" rel="external">Paxos</a> &#x7B97;&#x6CD5;&#x6765;&#x7EF4;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x5DF2;&#x7ECF;&#x6709;&#x51E0;&#x5E74;&#x7684;&#x5386;&#x53F2;&#x4E86;&#xFF0C;&#x76EE;&#x524D;&#x6709;&#x5C06;&#x8FD1;230&#x4E2A;Fork&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F88;&#x96BE;&#x5224;&#x65AD;&#x9879;&#x76EE;&#x7684;&#x771F;&#x5B9E;&#x72B6;&#x6001;&#xFF0C;&#x4E0D;&#x77E5;&#x5230;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x3002;</p>
<p>Doozer&#x901A;&#x5E38;&#x8FD0;&#x884C;&#x5728;&#x96C6;&#x7FA4;&#x7684;3&#x3001;5&#x3001;7&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#xFF0C;&#x7C7B;&#x4F3C;Zookeeper&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6839;&#x636E;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7279;&#x5B9A;&#x7684; <a href="https://cwiki.apache.org/confluence/display/ZOOKEEPER/ZKClientBindings" target="_blank" rel="external">Client Binding</a> &#x6765;&#x8BBF;&#x95EE;Doozer&#x96C6;&#x7FA4;&#xFF0C;&#x8BBF;&#x95EE;&#x901A;&#x5E38;&#x88AB;&#x5D4C;&#x5165;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x670D;&#x52A1;&#x4E2D;&#x3002;</p>
<p>Doozer&#x7684;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x4E0D;&#x50CF;Zookeeper&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;Doozer&#x6CA1;&#x6709;&#x4E34;&#x65F6;&#x8282;&#x70B9;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#x4E3A;&#x4E00;&#x4E2A;&#x8DEF;&#x5F84;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x670D;&#x52A1;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x5E76;&#x4E0D;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x79FB;&#x9664;&#x3002;</p>
<p>&#x6709;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;Doozer&#x4E0A;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x6CE8;&#x518C;&#x8FDB;&#x7A0B;&#x52A0;&#x5165;&#x65F6;&#x95F4;&#x6233;&#x548C;&#x5FC3;&#x8DF3;&#x68C0;&#x6D4B;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x8FDB;&#x7A0B;&#x4E2D;&#x5904;&#x7406;&#x670D;&#x52A1;&#x5931;&#x6548;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x6E05;&#x7406;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x7684;&#x8FC7;&#x7A0B;&#x548C;Zookeeper&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x83B7;&#x53D6;&#x6240;&#x6709;&#x5F53;&#x524D;&#x6CE8;&#x518C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7528;&#x6216;&#x8005;&#x65B0;&#x7684;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x540E;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x6536;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x901A;&#x77E5;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x5668;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x6233;&#x548C;&#x5FC3;&#x8DF3;&#x68C0;&#x6D4B;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x8FDB;&#x7A0B;&#x9700;&#x8981;&#x5FFD;&#x7565;&#x548C;&#x79FB;&#x9664;&#x8FC7;&#x671F;&#x65E0;&#x6548;&#x7684;&#x670D;&#x52A1;&#x5730;&#x5740;&#x3002;</p>
<p>&#x548C;Zookeeper&#x7C7B;&#x4F3C;&#xFF0C;Doozer&#x4E5F;&#x662F;&#x4E00;&#x4E2A;CP&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x6709;&#x5206;&#x533A;&#x5931;&#x8D25;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="etcd">Etcd</h2><p><a href="https://github.com/coreos/etcd" target="_blank" rel="external">Etcd</a> &#x662F;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x914D;&#x7F6E;&#x5171;&#x4EAB;&#x548C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x3001;&#x4F9D;&#x9760;&#x952E;&#x503C;&#x5BF9;&#x5B58;&#x50A8;&#x7684;&#x7CFB;&#x7EDF;&#x3002;Etcd&#x53D7;Zookeeper&#x548C;Doozer&#x7684;&#x542F;&#x53D1;&#xFF0C;&#x7528;Go&#x5B9E;&#x73B0;&#xFF0C;&#x4F7F;&#x7528; <a href="https://ramcloud.stanford.edu/wiki/download/attachments/11370504/raft.pdf" target="_blank" rel="external">Raft</a> &#x7B97;&#x6CD5;&#x6765;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x57FA;&#x4E8E;Http&#x548C;Json&#x7684;API&#x63A5;&#x53E3;&#x3002;</p>
<p>Etcd &#x548C; Zookeeper&#x3001;Doozer&#x76F8;&#x4F3C;&#xFF0C;&#x901A;&#x5E38;&#x8FD0;&#x884C;&#x5728;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;3&#x3001;5&#x3001;7&#x4E2A;&#x8282;&#x70B9;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x8BED;&#x8A00;&#x7ED1;&#x5B9A;&#x6216;&#x8005;&#x4F7F;&#x7528;Http&#x534F;&#x8BAE;&#x6765;&#x8BBF;&#x95EE;Etcd&#x3002;</p>
<p>&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x4F9D;&#x8D56;&#x4E8E;&#x952E;&#x503C;&#x7684;TTL&#xFF08;Time To Live&#xFF09;&#x548C;&#x5FC3;&#x8DF3;&#x673A;&#x5236;&#x6765;&#x786E;&#x4FDD;&#x670D;&#x52A1;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x4E0D;&#x80FD;&#x6210;&#x529F;&#x7684;&#x66F4;&#x65B0;TTL&#x7684;&#x503C;&#xFF0C;Etcd&#x5C06;&#x4F1A;&#x79FB;&#x9664;&#x8FD9;&#x4E2A;&#x952E;&#x503C;&#x5BF9;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x4E0D;&#x53EF;&#x8FBE;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x5904;&#x7406;&#x8FDE;&#x63A5;&#x5931;&#x8D25;&#x548C;&#x5C1D;&#x8BD5;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5B9E;&#x4F8B;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x53EA;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x952E;&#x503C;&#x5E76;&#x4E14;&#x7B49;&#x5F85;&#x76EE;&#x5F55;&#x7684;&#x6539;&#x53D8;&#x3002;&#x56E0;&#x4E3A;Etcd&#x7684;API&#x662F;&#x57FA;&#x4E8E;HTTP&#x534F;&#x8BAE;&#x7684;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x5229;&#x7528;&#x8F6E;&#x8BAD;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8BBF;&#x95EE;Etcd&#x96C6;&#x7FA4;&#x3002;</p>
<p>&#x7531;&#x4E8E;Etcd&#x4F7F;&#x7528;Raft&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x7CFB;&#x7EDF;&#xFF0C;Raft&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x9009;&#x4E3E;&#x51FA;&#x4E00;&#x4E2A;leader&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x8BF7;&#x6C42;&#x90FD;&#x9700;&#x8981;&#x7ECF;&#x8FC7;leader&#x5904;&#x7406;&#x3002;&#x4F46;&#x662F;&#xFF0C;Etcd&#x4E5F;&#x652F;&#x6301;&#x975E;leader&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x7684;&#x6765;&#x63D0;&#x9AD8;&#x8BFB;&#x53D6;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x6570;&#x636E;&#x5199;&#x7684;&#x65F6;&#x5019;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x7ECF;&#x8FC7;leader&#xFF0C;Etcd&#x4F9D;&#x7136;&#x5B58;&#x5728;&#x5206;&#x533A;&#x5931;&#x6548;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h1 id="&#x4E13;&#x7528;&#x578B;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x6846;&#x67B6;">&#x4E13;&#x7528;&#x578B;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x6846;&#x67B6;</h1><p>&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x6CE8;&#x518C;&#x670D;&#x52A1;&#x548C;&#x65B9;&#x6848;&#x662F;&#x4E13;&#x95E8;&#x5904;&#x7406;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x548C;&#x6CE8;&#x518C;&#x7684;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x5E94;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x548C;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x7136;&#x800C;&#xFF0C;Zookeeper&#x3001;Doozer&#x548C;Etcd&#x80FD;&#x591F;&#x88AB;&#x7528;&#x6765;&#x5904;&#x7406;&#x5206;&#x5E03;&#x5F0F;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x4E0B;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x65B9;&#x6848;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x80FD;&#x529B;&#x3002;</p>
<h2 id="airbnbs-smartstack">Airbnb&#x2019;s SmartStack</h2><p><a href="http://nerds.airbnb.com/smartstack-service-discovery-cloud/" target="_blank" rel="external">Airbnb&#x2019;s SmartStack</a> &#x662F; <a href="https://github.com/airbnb/nerve" target="_blank" rel="external">Nerve</a> &#x548C; <a href="https://github.com/airbnb/synapse" target="_blank" rel="external">Synapse</a> &#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x4ED6;&#x4EEC;&#x5206;&#x522B;&#x7ED3;&#x5408;&#x4E86; <a href="http://haproxy.1wt.eu/" target="_blank" rel="external">haproxy</a> &#x548C; <a href="http://zookeeper.apache.org/" target="_blank" rel="external">Zookeeper</a>&#x7528;&#x6765;&#x5904;&#x7406;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x53D1;&#x73B0;&#x3002;Nerve&#x548C;Synapse&#x662F;&#x7528;Ruby&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>Nerve&#x662F;&#x4E00;&#x4E2A;<em>sidekick</em>&#x98CE;&#x683C;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x548C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5206;&#x79BB;&#x8FD0;&#x884C;&#xFF0C;Nerve&#x8D1F;&#x8D23;&#x5728;Zookeeper&#x4E2D;&#x6CE8;&#x518C;&#x670D;&#x52A1;&#xFF0C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x53EA;&#x9700;&#x8981;&#x66B4;&#x9732;url&#x4E3A;&#x201C;/health&#x201D;&#xFF08;endpoint&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x7FFB;&#x8BD1;&#x6210;&#x7AEF;&#x70B9;&#xFF09;&#x7684;HTTP&#x670D;&#x52A1;&#xFF0C;Nerve&#x6301;&#x7EED;&#x7684;&#x5BF9;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#xFF0C;&#x5F53;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x5411;Zookeeper&#x6CE8;&#x518C;&#x670D;&#x52A1;&#x3002;</p>
<p><em>sidekick</em>&#x98CE;&#x683C;&#x7684;&#x6A21;&#x5757;&#x6D88;&#x9664;&#x4E86;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5185;&#x90E8;&#x548C;Zookeeper&#x4EA4;&#x4E92;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5B83;&#x53EA;&#x9700;&#x76D1;&#x63A7;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x66B4;&#x9732;&#x7684;&#x7AEF;&#x70B9;&#x5C31;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#x76F8;&#x5E94;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x80FD;&#x591F;&#x65B9;&#x4FBF;&#x7684;&#x652F;&#x6301;&#x4E0D;&#x540C;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x5E94;&#x7528;&#x670D;&#x52A1;&#xFF0C;&#x907F;&#x514D; <a href="https://cwiki.apache.org/confluence/display/ZOOKEEPER/ZKClientBindings" target="_blank" rel="external">Client Binding</a> &#x53EF;&#x7528;&#x6027;&#x5DEE;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x8FD9;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x591A;<a href="http://en.wikipedia.org/wiki/Hollywood_principle" target="_blank" rel="external">Hollywood principle</a> &#xFF08;&#x201C;Don&#x2019;t call us, we&#x2019;ll call you&#x201D;&#xFF09;&#x7684;&#x4F18;&#x70B9;&#x3002;</p>
<p>Synapse&#x4E5F;&#x662F;&#x91C7;&#x7528;<em>sidekick</em>&#x98CE;&#x683C;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x548C;&#x5E94;&#x7528;&#x5206;&#x79BB;&#x8FD0;&#x884C;&#xFF0C;Synapse&#x8D1F;&#x8D23;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;Zookeeper&#x4E2D;&#x5F53;&#x524D;&#x6CE8;&#x518C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x672C;&#x5730;&#x8FD0;&#x884C;&#x7684;haproxy&#x5B9E;&#x4F8B;&#xFF0C;&#x4EFB;&#x4F55;&#x9700;&#x8981;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x53EA;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x672C;&#x5730;&#x7684;haproxy&#x5B9E;&#x4F8B;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x8BF7;&#x6C42;&#x8DEF;&#x7531;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p>Synapse&#x7B80;&#x5316;&#x4E86;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x670D;&#x52A1;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x9700;&#x8981;&#x5904;&#x7406;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x5931;&#x6548;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;Zookeeper&#xFF0C;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x3002;</p>
<p>&#x7531;&#x4E8E;SmartStack&#x4F9D;&#x8D56;&#x4E8E;Zookeeper&#xFF0C;&#x4E00;&#x4E9B;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x548C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x5206;&#x533A;&#x5931;&#x8D25;&#x7684;&#x95EE;&#x9898;&#xFF0C;Zookeeper&#x88AB;&#x79F0;&#x4E3A;&#x662F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x963F;&#x514B;&#x7409;&#x65AF;&#x4E4B;&#x8E35;&#x3002;Provided a service has been able to discover the other services, at least once, before a partition, it should still have a snapshot of the services after the partition and may be able to continue operating during the partition. &#x8FD9;&#x4E00;&#x65B9;&#x9762;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7528;&#x6027;&#x548C;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>&#x66F4;&#x65B0;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5BF9;Docker&#x5BB9;&#x5668;&#x7684;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#x7684;&#x7C7B;&#x4F3C;SmartStack&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;<em>docker service discovery</em>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<h2 id="netflixs-eureka">Netflix&#x2019;s Eureka</h2><p><a href="https://github.com/Netflix/eureka" target="_blank" rel="external">Eureka</a> &#x662F; Netflix&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x63D0;&#x4F9B;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x5B83;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x7684;&#x7EC4;&#x4EF6;&#x548C;smart-client&#x88AB;&#x8FD0;&#x7528;&#x5230;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x4E2D;&#xFF0C;Eureka&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x662F;&#x91C7;&#x7528;Java&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x975E;&#x5E38;&#x9002;&#x7528;&#x4E8E;Java&#x5B9E;&#x73B0;&#x7684;&#x670D;&#x52A1;&#x6216;&#x8005;&#x5176;&#x4ED6;JVM&#x652F;&#x6301;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x3002;</p>
<p>&#x672A;&#x5B8C;&#x5F85;&#x7EED;&#x2026;.</p>
<table>
<thead>
<tr>
<th>Name</th>
<th>Type</th>
<th>AP or CP</th>
<th>Language</th>
<th>Dependencies</th>
<th>Integration</th>
</tr>
</thead>
<tbody>
<tr>
<td>Zookeeper</td>
<td>General</td>
<td>CP</td>
<td>Java</td>
<td>JVM</td>
<td>Client Binding</td>
</tr>
<tr>
<td>Doozer</td>
<td>General</td>
<td>CP</td>
<td>Go</td>
<td></td>
<td>Client Binding</td>
</tr>
<tr>
<td>Etcd</td>
<td>General</td>
<td>Mixed (1)</td>
<td>Go</td>
<td></td>
<td>Client Binding/HTTP</td>
</tr>
<tr>
<td>SmartStack</td>
<td>Dedicated</td>
<td>AP</td>
<td>Ruby</td>
<td>haproxy/Zookeeper</td>
<td>Sidekick (nerve/synapse)</td>
</tr>
<tr>
<td>Eureka</td>
<td>Dedicated</td>
<td>AP</td>
<td>Java</td>
<td>JVM</td>
<td>Java Client</td>
</tr>
<tr>
<td>NSQ (lookupd)</td>
<td>Dedicated</td>
<td>AP</td>
<td>Go</td>
<td></td>
<td>Client Binding</td>
</tr>
<tr>
<td>Serf</td>
<td>Dedicated</td>
<td>AP</td>
<td>Go</td>
<td></td>
<td>Local CLI</td>
</tr>
<tr>
<td>Spotify (DNS)</td>
<td>Dedicated</td>
<td>AP</td>
<td>N/A</td>
<td>Bind</td>
<td>DNS Library</td>
</tr>
<tr>
<td>SkyDNS</td>
<td>Dedicated</td>
<td>Mixed (2)</td>
<td>Go</td>
<td></td>
<td>HTTP/DNS Library</td>
</tr>
</tbody>
</table>
<h1 id="&#x539F;&#x6587;&#x5730;&#x5740;&#x548C;&#x53C2;&#x8003;&#x6587;&#x732E;">&#x539F;&#x6587;&#x5730;&#x5740;&#x548C;&#x53C2;&#x8003;&#x6587;&#x732E;</h1><p>&#x539F;&#x6587;&#xFF1A;<a href="http://jasonwilder.com/blog/2014/02/04/service-discovery-in-the-cloud/" target="_blank" rel="external">http://jasonwilder.com/blog/2014/02/04/service-discovery-in-the-cloud/</a></p>

      
    </div>
    
      <div class="article-toc">
        <h3>目录</h3>
        <ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#问题"><span class="toc-number">1.</span> <span class="toc-text">问题</span></a></li><li class="toc-item toc-level-1"><a class="toc-link" href="#通用型服务注册框架"><span class="toc-number">2.</span> <span class="toc-text">通用型服务注册框架</span></a><ol class="toc-child"><li class="toc-item toc-level-2"><a class="toc-link" href="#zookeeper"><span class="toc-number">2.1.</span> <span class="toc-text">Zookeeper</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#doozer"><span class="toc-number">2.2.</span> <span class="toc-text">Doozer</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#etcd"><span class="toc-number">2.3.</span> <span class="toc-text">Etcd</span></a></li></ol></li><li class="toc-item toc-level-1"><a class="toc-link" href="#专用型服务注册框架"><span class="toc-number">3.</span> <span class="toc-text">专用型服务注册框架</span></a><ol class="toc-child"><li class="toc-item toc-level-2"><a class="toc-link" href="#airbnbs-smartstack"><span class="toc-number">3.1.</span> <span class="toc-text">Airbnb’s SmartStack</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#netflixs-eureka"><span class="toc-number">3.2.</span> <span class="toc-text">Netflix’s Eureka</span></a></li></ol></li><li class="toc-item toc-level-1"><a class="toc-link" href="#原文地址和参考文献"><span class="toc-number">4.</span> <span class="toc-text">原文地址和参考文献</span></a></li></ol>
      </div>
    
    
      <footer class="article-footer">
        
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/服务发现/">服务发现</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/服务注册/">服务注册</a></li></ul>

      </footer>
    
  </div>
  
    
<nav id="article-nav">
  
    <a href="/2016/03/21/article/java_byte_code_iinc/" id="article-nav-newer" class="article-nav-link-wrap">
      <div class="article-nav-title"><span>&lt;</span>&nbsp;
        
          从Java字节码角度分析i++和++i
        
      </div>
    </a>
  
  
    <a href="/2015/11/22/article/LaTeX-insert-image/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">LaTex插入图片&nbsp;<span>&gt;</span></div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>
</section>
    <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2016 Andy Doo&nbsp;
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>, theme by <a href="http://github.com/ppoffice">PPOffice</a>
    </div>
  </div>
</footer>
    
<script>
  var disqus_shortname = 'andy012';
  
  var disqus_url = 'http://blog.duhongguang.com/2016/01/22/translations/Open-Source-Service-Discovery/';
  
  (function(){
    var dsq = document.createElement('script');
    dsq.type = 'text/javascript';
    dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>


<script src="/js/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css" type="text/css">
  <script src="/fancybox/jquery.fancybox.pack.js" type="text/javascript"></script>


<script src="/js/script.js" type="text/javascript"></script>
  </div>
</body>
</html>